app/controllers/students_controller.rb

  def create
    #binding.pry
    @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "ale"], ["last_name", "alejo"], ["created_at", "2019-12-12 01:08:19.049016"], ["updated_at", "2019-12-12 01:08:19.049016"]]

  def show
    #binding.pry
    @student = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (1) LIMIT ?  [["LIMIT", 1]]

  def edit
    #binding.pry
    @student = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (4) LIMIT ?  [["LIMIT", 1]]

  def update
    #binding.pry
    @student = Student.find_by(params[:id])
---
SELECT  "students".* FROM "students" WHERE (3) LIMIT ?  [["LIMIT", 1]]